// დავალება 1
//  შექმენით მასივი ნებისმიერი ტიპის და რაოდენობის ელემენტებით.
//  ეკრანზე გამოიტანეთ ამ მასივის სიგრძე.

let arr = [1, "hello", true, 3.14];
console.log(arr.length);

// -------------------------------------------

// დავალება 2
// მოცემულია მასივი arr.
// ინდექსის გამოყენებით მასივს დაამატეთ ახალი ელემენტი 'd', ხოლო რიგით მეორე ელემენტი ჩაანაცვლეთ 'x'-ით.
// let arr = ['a', 'b', 'c'];

let arr = ["a", "b", "c"];
arr[3] = "d"; // ახალი ელემენტი დავამატე ინდექსით
arr[1] = "x"; // მეორე ელემენტის ჩავანაცვლე
console.log(arr);

//---------------------------------------------

// დავალება 3
// მოცემულია ცარიელი მასივი arr.
// მეთოდი .push-ის გამოყენებით მასივს დაამატეთ ახალი ელემენტები 'a', 'b' და 'c'.
// let arr = [];

let arr = [];
arr.push("a");
arr.push("b");
arr.push("c");
console.log(arr);

// ----------------------------------------------

// დავალება 4
// მოცემულია კოდი, რომელმაც კონსოლზე უნდა გამოიტანოს მასივის ბოლო ელემნტი.
// აღმოაჩინეთ შეცდომა კოდში.
// let arr = [11, 22, 33, 44, 55];
// console.log(arr[arr.length]);

let arr = [11, 22, 33, 44, 55];
console.log(arr[arr.length - 1]);

/*შეცდომა იმაში იყო რომ  arr.length აბრუნებს მასივის ელემენტების რაოდენობას. ამ შემთხვევაში arr.length_ 5, - მაგრამ მასივის ინდექსები იწყება 0-დან და ბოლო ელემენტი არის arr[4] ანუ arr.length-1  */

// -------------------------------------------------

// დავალება 5
// შექმენით მასივი [1, 2, 3, 4, 5] და გამოიყენეთ for ციკლი ყველა ელემენტის კონსოლში გამოსატანად.

let arr = [1, 2, 3, 4, 5];
for (let i = 0; i < arr.length; i++) {
  console.log(arr[i]);
}

// -------------------------------------------------

// დავალება 6
// შექმენით მასივი [1, 2, 3, 4, 5] და გამოიყენეთ for ... of ციკლი ყველა ელემენტის კონსოლში გამოსატანად.

let arr = [1, 2, 3, 4, 5];
for (let element of arr) {
  console.log(element);
}

// --------------------------------------------------

// დავალება 7
// შექმენით მასივი სიტყვებით(string) და დაბეჭდეთ მხოლოდ ის სიტყვები, რომელთა სიგრძე 4-ზე მეტია.

let words = ["tree", "book", "computer", "sun", "school", "pen"];
for (let word of words) {
  if (word.length > 4) {
    console.log(word);
  }
}

// ---------------------------------------------------
